---
kind: property
id: P:Autodesk.Revit.DB.Lighting.AdvancedLossFactor.LampLumenDepreciation
source: html/3c1a96f2-6934-8b25-4d18-71ee5fdd9d6a.htm
---
# Autodesk.Revit.DB.Lighting.AdvancedLossFactor.LampLumenDepreciation Property

The lamp lumen depreciation loss factor.

## Syntax (C#)
```csharp
public double LampLumenDepreciation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The loss factor is not valid because it is not between 0.0 and 1.0.